0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1.;

boundaryField
{
    Inlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 1.0045;
    }

    Outlet
    {
        type            zeroGradient;
    }

   Side
    {
        type            empty;
    }

    Cylinder
    {
        type            zeroGradient;
    }

    Wall
    {
        type            zeroGradient;
    }
        Top
    {
                // type            zeroGradient;
        // type            totalTemperature;
        // gamma           1.4;
        // T0              uniform 1.0045;
        type slip;
    }
}

// ************************************************************************* //
