0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

// internalField   uniform 1.5e-5;
internalField   uniform 1.7748239349298848e-05;

boundaryField
{
    Inlet
    {
 	// type           inletOutlet; 
    //   inletValue     $internalField;

        type calculated;
    value $internalField;
    }

    Side
    {
        type            empty;
    }

    Outlet
    {
        type zeroGradient;
    }

    Cylinder
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    Wall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
        Top
    {
        // type            calculated;
        // value           $internalField;
          type slip;
    //      	type           inletOutlet; 
    //   inletValue     $internalField;
        // type zeroGradient;

    }
}


// ************************************************************************* //
