0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 2.054152653772353e-06; // 

boundaryField
{
    Inlet
    {
      type               inletOutlet; 
      inletValue       $internalField;
    }

    Outlet
    {
      type              zeroGradient;
    }


    Side
    {
        type            empty;
    }

    Cylinder
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    Wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    Top {
    type slip;
    }
}

// ************************************************************************* //
