0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.;

boundaryField
{
    Inlet 
    {
        type            totalPressure;
        p0              uniform 1.0158387931980135; // total pressure at the inlet
        // U               U;
        value $internalField;
        gamma 1.4;
        //U             uniform (0.17748239349298847 0 0);
    }

    Outlet
    {
       type             fixedValue;
       value         $internalField;
    //        type            zeroGradient;
    }


    Side
    {
        type            empty;
    }

    Cylinder 
    {
        type            zeroGradient;
    }
    Wall
    {
        type            zeroGradient;
    }
    Top
    {
            //    type             fixedValue;
    //    value         $internalField;
        //         type            totalPressure;
        // p0              uniform 1.0158387931980135; // total pressure at the inlet
    type slip;
    }
}


// ************************************************************************* //
