constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Side
    {
        type            empty;
        // physicalType    patch;
        nFaces          189384;
        startFace       188552;
    }
    Inlet
    {
        type            patch;
        // physicalType    patch;
        nFaces          147;
        startFace       377936;
    }
    Wall
    {
        type            wall;
        // physicalType    patch;
        nFaces          627;
        startFace       378083;
    }
    Outlet
    {
        type            patch;
        // physicalType    patch;
        nFaces          147;
        startFace       378710;
    }
    Top
    {
        type            wall;
        // physicalType    patch;
        nFaces          627;
        startFace       378857;
    }
    Cylinder
    {
        type            wall;
        // physicalType    patch;
        nFaces          116;
        startFace       379484;
    }
)

// ************************************************************************* //
